{
  "backend/main.mo": "Main actor defining data types (UserProfile, Post, Reply, Conversation, Message, Report, ModerationAction) and state management for a debate platform with profile management, posts, messaging, moderation, and authorization using mixins.",
  "backend/migration.mo": "Migration module that transforms OldUserProfile to NewUserProfile by adding a pinterest field to SocialMediaLinks, defaulting it to null for existing profiles.",
  "feature_evidence.json": "Feature evidence report documenting three Pinterest-related features: adding Pinterest input to ProfileSetupModal, displaying Pinterest link on ProfilePage, and enabling Pinterest editing in profile functionality.",
  "frontend-file-summaries.txt": "Summaries of frontend components and pages, noting that ProfileSetupModal and ProfilePage already include Pinterest alongside Facebook, Twitter, and Instagram social media links.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors, including background, foreground, primary, secondary, accent, border, and chart colors.",
  "frontend/index.html": "HTML entry point for the Global Activist Debate application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for home, four debate sections (civil, aggressive, quotes, random), profile, messaging, random debate, and moderator dashboard, wrapped in ThemeProvider with ProfileSetupModal.",
  "frontend/src/components/ConversationList.tsx": "Displays a list of conversations with participant names and last message preview, highlighting the selected conversation and filtering out the current user from participants.",
  "frontend/src/components/CreatePostForm.tsx": "Form component for creating posts with content textarea, optional image upload with preview, and section-specific submission, requiring authentication.",
  "frontend/src/components/DebateStyleBadge.tsx": "Renders a colored badge component displaying the debate style (Civil, Aggressive, Creative, or Random) with corresponding theme colors.",
  "frontend/src/components/DebateStyleSelector.tsx": "Provides a grid of selectable cards for choosing between Civil and Aggressive debate styles, each with an icon, description, and visual selection state.",
  "frontend/src/components/FollowButton.tsx": "Displays a follow/unfollow button for user profiles, checking current follow status and toggling it via mutation hooks.",
  "frontend/src/components/Layout.tsx": "Main application layout with sticky header, logo, navigation (Messages, Moderator for admins), mobile menu sheet, footer with social links, and section navigation sidebar.",
  "frontend/src/components/LikeButton.tsx": "Like button with heart icon that toggles like state for posts and shows a hover card listing users who liked the post.",
  "frontend/src/components/LoginButton.tsx": "Authentication button that handles Internet Identity login/logout with loading states and query cache clearing on logout.",
  "frontend/src/components/MessageThread.tsx": "Displays a conversation thread with participant list, scrollable message history, and a textarea form for sending new messages.",
  "frontend/src/components/ModerationActions.tsx": "Provides moderation action buttons (warning, strike, ban) for reports with user history display and progressive enforcement logic.",
  "frontend/src/components/PlatformRules.tsx": "Displays a card grid showing the four main platform rules (no personal attacks, opinions only, civil debates, aggressive debates) with icons and descriptions.",
  "frontend/src/components/PostCard.tsx": "Renders a post card with author info, content, media, section badge, pinned indicator, like/reply buttons, and collapsible reply section.",
  "frontend/src/components/PostFeed.tsx": "Displays a sorted list of PostCard components with optional pinned-first sorting and empty state message.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time user profile setup, collecting username, avatar, interests, debate style, and social media links. Prevents dismissal until profile is created.",
  "frontend/src/components/RandomDebateButton.tsx": "Button component that navigates to the random debate partner matching page with gradient styling.",
  "frontend/src/components/ReplySection.tsx": "Displays replies to a post with timestamps and user links, includes a form for authenticated users to add new replies and report buttons.",
  "frontend/src/components/ReportButton.tsx": "Small flag button that opens the report modal for authenticated users to report content violations.",
  "frontend/src/components/ReportList.tsx": "Displays a list of content reports with violation type, status badges, timestamps, and moderation actions for pending reports.",
  "frontend/src/components/ReportModal.tsx": "Modal form for submitting content reports with violation type selection and description textarea.",
  "frontend/src/components/SectionNavigation.tsx": "Horizontal navigation bar with icon buttons for different debate sections (civil, aggressive, quotes, random) with active state highlighting.",
  "frontend/src/components/StartConversationModal.tsx": "Modal form for initiating direct or group conversations by entering another user's principal ID.",
  "frontend/src/components/UserLink.tsx": "Clickable user link component displaying avatar and username, navigates to user profile page on click.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on authentication state, initializing access control with admin token and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for all backend operations including user profiles, posts (create, like, reply), conversations, messages, reports, and moderation actions with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, activist brand colors (blue, green, orange), and utility classes for scrollbar hiding and color application.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, random debate button, latest discussions feed, and platform rules sidebar with loading skeletons.",
  "frontend/src/pages/MessagingPage.tsx": "Two-column messaging interface showing conversation list and message thread with new conversation modal, requiring authentication to access.",
  "frontend/src/pages/ModeratorDashboard.tsx": "Admin-only dashboard displaying reports in tabs (pending, reviewed, resolved) with warning progression system (3 warnings → 1 strike → ban).",
  "frontend/src/pages/ProfilePage.tsx": "Displays user profile page with avatar, username, debate style badge, follow button, interests, social media links, and a feed of the user's posts filtered by author principal.",
  "frontend/src/pages/RandomDebatePage.tsx": "Provides UI for random debate matching where authenticated users can select a debate style and opt-in to find a debate partner, with a waiting state animation (backend matching logic not yet implemented).",
  "frontend/src/pages/SectionPage.tsx": "Renders section-specific pages (Civil Debate, Aggressive Debate, Quotes & Poems, Random Debates) with filtered post feeds, create post form, and platform rules sidebar.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from query strings or hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, container settings, border radius variables, custom animations, and typography/container-queries plugins.",
  "project_state.json": "Project metadata defining the Global Activist Debate platform architecture, including authentication, debate categorization, moderation system, messaging, and tracking implemented features mapped to requirements."
}