{
  "backend/main.mo": "Main actor defining the debate platform's data types (UserProfile, Post, Reply, Conversation, Report, etc.) and implementing profile, post, messaging, moderation, and follow management functions with authorization and blob storage mixins.",
  "backend/migration.mo": "Empty migration module with placeholder types and run function for future data migration support.",
  "feature_evidence.json": "Feature evidence report documenting a high-confidence fix for compilation/deployment errors related to moderation components and various dependencies.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend React components and pages, describing their functionality including avatar customization, post feeds, messaging, moderation dashboard, and navigation.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color schemes using OKLCH color space for the activist debate platform.",
  "frontend/index.html": "HTML entry point with root div and module script import for the React application titled 'Global Activist Debate'.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for all sections (civil, aggressive, quotes, random), profile, messaging, random debate matching, and moderator dashboard, wrapped with ThemeProvider and ProfileSetupModal.",
  "frontend/src/components/AvatarBuilder.tsx": "Interactive avatar customization component with tabbed interface for selecting skin tone, hair style/color, eyewear, and clothing options, displaying live preview via AvatarPreview component.",
  "frontend/src/components/AvatarPreview.tsx": "SVG-based avatar rendering component that generates visual representation of AvatarCustomization with configurable size (small/medium/large) and renders hair, eyewear, and clothing based on selected options.",
  "frontend/src/components/ConversationList.tsx": "Displays a list of conversations with participants and last message preview, allowing users to select a conversation. Filters out the current user from participant display and highlights the selected conversation.",
  "frontend/src/components/CreatePostForm.tsx": "Form component for creating posts with text content and optional image upload. Handles media preview, file conversion to ExternalBlob, and submits posts to a specific section.",
  "frontend/src/components/DebateStyleBadge.tsx": "Renders a colored badge displaying the debate style (Civil, Aggressive, Creative, or Random) with appropriate styling for each type.",
  "frontend/src/components/DebateStyleSelector.tsx": "Interactive selector component for choosing between Civil and Aggressive debate styles, displaying icons and descriptions with visual feedback for the selected style.",
  "frontend/src/components/FollowButton.tsx": "Toggle button for following/unfollowing users, checking current follow status and hiding when viewing own profile or not authenticated.",
  "frontend/src/components/HelpModal.tsx": "Modal dialog with tabbed interface providing help documentation about getting started, platform features, and community rules using accordions and scrollable content.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper with sticky header, navigation menu (desktop and mobile), social media links in footer, and conditional rendering based on authentication and admin status.",
  "frontend/src/components/LikeButton.tsx": "Button for liking/unliking posts with heart icon, displaying like count and showing a hover card with list of users who liked the post.",
  "frontend/src/components/LoginButton.tsx": "Authentication button that handles Internet Identity login/logout with loading states and error handling for duplicate authentication attempts.",
  "frontend/src/components/MessageThread.tsx": "Displays a conversation thread with participants, scrollable messages, and a form to send new messages. Includes participant profiles with debate style badges and timestamps.",
  "frontend/src/components/ModerationActions.tsx": "Provides moderation controls for reports, allowing moderators to issue warnings, strikes, or bans based on user history. Shows moderation history and enforces escalation rules (3 warnings → strike, strike → ban).",
  "frontend/src/components/PlatformRules.tsx": "Displays a card with four platform rules covering personal attacks, opinions, civil debates, and aggressive debates with icons and descriptions.",
  "frontend/src/components/PostCard.tsx": "Renders a single post with author info, content, media, section badge, like button, and collapsible reply section. Supports pinned posts and report functionality.",
  "frontend/src/components/PostFeed.tsx": "Displays a sorted list of posts using PostCard components, optionally showing pinned posts first. Shows empty state when no posts exist.",
  "frontend/src/components/ProfileEditModal.tsx": "Modal dialog for editing user profile including username, avatar customization, interests, debate style, and social media links. Pre-populates with existing profile data.",
  "frontend/src/components/ProfileSetupModal.tsx": "Forced modal for new users to set up their profile with username, avatar, interests, debate style, and social media. Cannot be dismissed until completed.",
  "frontend/src/components/RandomDebateButton.tsx": "Button component that navigates to the random debate partner matching feature with shuffle icon and gradient styling.",
  "frontend/src/components/ReplySection.tsx": "Displays replies to a post with author info and timestamps, plus a form for authenticated users to add new replies. Includes report functionality for each reply.",
  "frontend/src/components/ReportButton.tsx": "A button component that displays a flag icon and opens a ReportModal when clicked, only visible to authenticated users.",
  "frontend/src/components/ReportList.tsx": "Displays a list of reports as cards showing report details (ID, violation type, status, timestamp, description, content type) with moderation actions for pending reports.",
  "frontend/src/components/ReportModal.tsx": "A dialog modal for submitting content reports with fields for violation type selection and description text, using the useReportContent mutation hook.",
  "frontend/src/components/SectionNavigation.tsx": "Navigation bar component displaying buttons for four debate sections (Civil, Aggressive, Quotes, Random) with icons and active state highlighting.",
  "frontend/src/components/StartConversationModal.tsx": "Modal dialog for starting new conversations by entering a participant's Principal ID and selecting conversation type (direct or group).",
  "frontend/src/components/UserLink.tsx": "Clickable user link component that displays username and optional avatar, navigating to the user's profile page when clicked.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on authentication state, initializing access control and invalidating queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for data fetching and mutations including user profiles, posts, conversations, reports, and moderation actions with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, including activist-specific color utilities (blue, green, orange) and scrollbar-hide utility classes.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, latest discussions feed using PostFeed component, platform rules sidebar, and a random debate button.",
  "frontend/src/pages/MessagingPage.tsx": "Messaging interface with conversation list sidebar and message thread view, including modal to start new conversations; requires authentication.",
  "frontend/src/pages/ModeratorDashboard.tsx": "Admin-only dashboard displaying reports in tabs (pending, reviewed, resolved) with moderation system showing warning/strike progression rules.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page displaying avatar, username, debate style, interests, social media links, and user's posts; includes edit functionality for own profile and follow button for others.",
  "frontend/src/pages/RandomDebatePage.tsx": "Page for finding random debate partners with debate style selector and opt-in matching functionality (UI placeholder for backend matching logic).",
  "frontend/src/pages/SectionPage.tsx": "Generic section page component that displays posts filtered by section type (civil debate, aggressive debate, quotes/poems, random debates) with create post form and platform rules sidebar.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and functions to clear sensitive parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, container settings, border radius variables, custom shadows, font families, and keyframe animations for UI components.",
  "project_state.json": "Project state document describing Global Activist Debate platform architecture, features (authentication, profiles, debates, messaging, moderation), and known issues including missing profile navigation and glitchy avatar builder."
}