{
  "backend/main.mo": "Main Motoko actor defining the backend with authorization, blob storage, user profiles, posts, conversations, messaging, reports, moderation actions, and social features like following users and topics.",
  "feature_evidence.json": "Feature evidence report documenting three features for updating StartConversationModal to use username input instead of Principal ID, adding username lookup query to useQueries hook, and resolving usernames to Principal IDs before conversation creation.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components, pages, and hooks describing UI elements, state management, authentication flows, and user interactions across the debate platform application.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors, including activist-themed color schemes for backgrounds, borders, accents, and chart colors.",
  "frontend/index.html": "HTML entry point for the React application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main app component configuring TanStack Router with routes for home, sections, profile, messaging, random debate, and moderator dashboard, plus ProfileSetupModal that shows when authenticated users lack profiles.",
  "frontend/src/components/AvatarBuilder.tsx": "Empty file placeholder for avatar builder component.",
  "frontend/src/components/AvatarPreview.tsx": "Empty file placeholder for avatar preview component.",
  "frontend/src/components/ConversationList.tsx": "Displays list of conversations with participant names, last message preview, and selection highlighting for the messaging interface.",
  "frontend/src/components/CreatePostForm.tsx": "Form component for creating posts with content textarea, optional media upload with preview/removal, section-specific submission, toast notifications, and automatic form clearing on success.",
  "frontend/src/components/DebateStyleBadge.tsx": "Badge component displaying debate style (Civil, Aggressive, Creative, Random) with color-coded styling matching activist theme colors.",
  "frontend/src/components/DebateStyleSelector.tsx": "A component that displays a grid of selectable debate style cards (Civil and Aggressive) with icons, descriptions, and visual feedback for the selected style.",
  "frontend/src/components/FollowButton.tsx": "A button component that allows authenticated users to follow/unfollow other users, displaying appropriate icons and states based on the current follow relationship.",
  "frontend/src/components/HelpModal.tsx": "A modal dialog with tabbed content providing help documentation for getting started, platform features, and community rules using accordions and scrollable areas.",
  "frontend/src/components/Layout.tsx": "The main application layout component with sticky header, navigation, mobile menu sheet, and authentication-aware UI elements including profile avatar and moderator access.",
  "frontend/src/components/LikeButton.tsx": "A button component for liking/unliking posts with a heart icon, showing like count and a hover card that displays a list of users who liked the post.",
  "frontend/src/components/LoginButton.tsx": "A button component that handles Internet Identity authentication, toggling between login and logout states with loading indicators and error handling.",
  "frontend/src/components/MessageThread.tsx": "Displays a conversation thread with participant list, scrollable message history with timestamps, and a textarea form for sending new messages.",
  "frontend/src/components/ModerationActions.tsx": "Provides moderation action buttons (warning, strike, ban) for reports with user history display and logic for escalating enforcement based on violation count.",
  "frontend/src/components/PlatformRules.tsx": "A card component displaying the platform's four main rules (no personal attacks, opinions only, civil debates, aggressive debates) in a grid layout with icons.",
  "frontend/src/components/PostCard.tsx": "Displays a single post with author info, timestamp, section badge, content, media, likes, and replies. Includes toggleable reply section and report button.",
  "frontend/src/components/PostFeed.tsx": "Renders a list of posts sorted by timestamp, with optional pinned-first sorting. Shows empty state message when no posts exist.",
  "frontend/src/components/ProfileEditModal.tsx": "Modal dialog for editing user profile including username, interests, debate style, and social media links. Pre-populates with current profile data.",
  "frontend/src/components/ProfileSetupModal.tsx": "Non-dismissible modal for first-time profile setup with username, interests, debate style, and optional social media fields. Required for new users.",
  "frontend/src/components/RandomDebateButton.tsx": "Button component that navigates to the random debate partner matching page with gradient styling.",
  "frontend/src/components/ReplySection.tsx": "Displays replies for a post with author info and timestamps, plus a form for authenticated users to add new replies. Includes report buttons for each reply.",
  "frontend/src/components/ReportButton.tsx": "Flag icon button that opens the report modal for posts, replies, or user profiles. Only visible to authenticated users.",
  "frontend/src/components/ReportList.tsx": "Displays a list of reports with violation type, status badges, timestamps, and moderation actions for pending reports. Shows empty state when no reports exist.",
  "frontend/src/components/ReportModal.tsx": "Modal form for reporting content violations with violation type selector and description textarea. Submits reports to backend.",
  "frontend/src/components/SectionNavigation.tsx": "Horizontal navigation bar with icon buttons for the four debate sections (Civil, Aggressive, Quotes, Random). Highlights active section.",
  "frontend/src/components/StartConversationModal.tsx": "Modal dialog for starting a new conversation by entering a username, looking up the user's Principal ID, and creating a direct or group conversation.",
  "frontend/src/components/UserAvatar.tsx": "Displays a circular avatar with the first letter of a username and a consistent color generated from the username hash.",
  "frontend/src/components/UserLink.tsx": "Renders a clickable link to a user's profile with optional avatar, fetching user profile data and handling loading/error states.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance with authentication, initializing access control and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login/logout functionality, identity management, and status tracking through React context.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including user profiles, posts, conversations, likes, reports, and moderation actions.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, activist brand colors (blue, green, orange), and utility classes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, random debate button, post creation form for authenticated users, and a feed of latest discussions with platform rules sidebar.",
  "frontend/src/pages/MessagingPage.tsx": "Displays a two-column messaging interface with a conversation list and message thread, including a modal to start new conversations. Requires authentication via Internet Identity.",
  "frontend/src/pages/ModeratorDashboard.tsx": "Admin-only dashboard for reviewing user reports organized by status (pending, reviewed, resolved) with tabs. Displays moderation policy (3 warnings → 1 strike → ban).",
  "frontend/src/pages/ProfilePage.tsx": "Displays user profile with avatar, debate style, interests, social media links, and user's posts. Includes follow button and edit modal for own profile.",
  "frontend/src/pages/RandomDebatePage.tsx": "UI for random debate matching where users select a debate style and opt-in to find a debate partner. Backend matching logic is not yet implemented.",
  "frontend/src/pages/SectionPage.tsx": "Generic section page component that filters and displays posts by section type (civil debate, aggressive debate, quotes/poems, random debates) with a create post form and platform rules sidebar.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from query strings or hash-based routing, with sessionStorage persistence and cleanup helpers.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, container settings, extended theme with activist-specific colors, and animation keyframes.",
  "project_state.json": "Project state file tracking a global activist debate platform with user authentication, profiles, debate forums (civil/aggressive), messaging, moderation, and avatar customization. Documents 27 versions of progress, known issues with avatar builder UI, and lists existing/planned features with requirement mappings."
}