{
  "backend/main.mo": "Main backend actor defining all data types (UserProfile, Post, Reply, Conversation, Message, Report, ModerationAction) and implementing profile management, posts, conversations, reports, moderation, and follow functionality with authorization checks.",
  "backend/migration.mo": "Migration module defining old data types (OldUserProfile with avatar customization, posts, conversations, reports, moderationActions) to support data migration from previous schema versions.",
  "feature_evidence.json": "Feature evidence report documenting three features: fixing profile icon visibility, replacing avatar displays with letter-in-circle design, and removing AvatarBuilder from profile modals.",
  "frontend-file-summaries.txt": "Text file containing summaries of all frontend components and pages, describing their functionality including the letter-in-circle avatar implementation and removal of avatar customization.",
  "frontend/index.css": "Global CSS file with Tailwind directives and CSS custom properties defining light and dark theme color variables for the application.",
  "frontend/index.html": "HTML entry point with root div and script tag loading the React application from main.tsx.",
  "frontend/src/App.tsx": "Root application component setting up TanStack Router with all routes, ThemeProvider, ProfileSetupModal that shows when authenticated users lack profiles, and Toaster for notifications.",
  "frontend/src/components/AvatarBuilder.tsx": "Empty file, avatar builder component has been removed as part of simplification to letter-in-circle avatars.",
  "frontend/src/components/AvatarPreview.tsx": "Empty file, avatar preview component has been removed as part of simplification to letter-in-circle avatars.",
  "frontend/src/components/ConversationList.tsx": "Displays list of conversations with participant names (using UserLink), last message preview, and selection highlighting for the messaging interface.",
  "frontend/src/components/CreatePostForm.tsx": "Form component for creating posts with text content and optional image uploads, handling file preview and submission to a specific section. Requires user authentication via Internet Identity.",
  "frontend/src/components/DebateStyleBadge.tsx": "Displays a colored badge representing a debate style (civil, aggressive, creative, or random) with corresponding labels and theme colors.",
  "frontend/src/components/DebateStyleSelector.tsx": "Interactive selector component that displays debate style options (civil and aggressive) as clickable cards with icons, descriptions, and visual feedback for the selected style.",
  "frontend/src/components/FollowButton.tsx": "Toggle button for following/unfollowing users, showing appropriate icon and state based on current follow status. Hidden for unauthenticated users and when viewing own profile.",
  "frontend/src/components/HelpModal.tsx": "Modal dialog with tabbed interface providing onboarding information about profile setup, creating posts, platform sections, and community rules using accordions and scrollable content.",
  "frontend/src/components/Layout.tsx": "Main application layout with sticky header, navigation (desktop and mobile), social media links in footer, and routing outlet. Includes profile avatar, messages, moderator access, and help modal integration.",
  "frontend/src/components/LikeButton.tsx": "Button for liking/unliking posts with heart icon and count, featuring a hover card that displays up to 5 users who liked the post.",
  "frontend/src/components/LoginButton.tsx": "Authentication button that handles Internet Identity login/logout with loading states, clearing query cache on logout and handling authentication errors.",
  "frontend/src/components/MessageThread.tsx": "Displays a conversation thread with participant list, scrollable message history with timestamps, and a text input form for sending new messages.",
  "frontend/src/components/ModerationActions.tsx": "Provides moderation action buttons (warning, strike, ban, resolve) for reports, displaying user moderation history and enforcing progressive discipline rules based on warning/strike counts.",
  "frontend/src/components/PlatformRules.tsx": "Displays a card grid of four platform rules covering personal attacks, opinions, civil debates, and aggressive debates with icons and descriptions.",
  "frontend/src/components/PostCard.tsx": "Renders a single post with author info, content, media, section badge, pinned status, like/reply buttons, and expandable reply section with report functionality.",
  "frontend/src/components/PostFeed.tsx": "Displays a sorted list of posts using PostCard components, optionally showing pinned posts first, with an empty state message.",
  "frontend/src/components/ProfileEditModal.tsx": "Modal dialog for editing user profile including username, interests, debate style, and social media links with form validation and save functionality.",
  "frontend/src/components/ProfileSetupModal.tsx": "Non-dismissible modal for first-time profile setup requiring username, interests, debate style, and optional social media links for new users.",
  "frontend/src/components/RandomDebateButton.tsx": "Navigation button with shuffle icon that redirects users to the random debate partner matching feature.",
  "frontend/src/components/ReplySection.tsx": "Displays existing replies with author info and timestamps, plus a textarea form for authenticated users to add new replies to a post.",
  "frontend/src/components/ReportButton.tsx": "Small flag button that opens the ReportModal for authenticated users to report posts, replies, or user profiles.",
  "frontend/src/components/ReportList.tsx": "Displays a list of reports as cards showing violation type, status, description, reported content details, and moderation actions for pending reports.",
  "frontend/src/components/ReportModal.tsx": "Modal dialog component for reporting content violations with a form to select violation type (spam, harassment, etc.) and provide a description.",
  "frontend/src/components/SectionNavigation.tsx": "Navigation bar component displaying section buttons (Civil, Aggressive, Quotes, Random) with icons, highlighting the active section.",
  "frontend/src/components/StartConversationModal.tsx": "Modal dialog for initiating new conversations by entering a participant's Principal ID and selecting conversation type (direct or group).",
  "frontend/src/components/UserAvatar.tsx": "Avatar component that displays a colored circle with the first letter of a username, using consistent color generation based on the username hash.",
  "frontend/src/components/UserLink.tsx": "Link component that displays a user's avatar and username, fetching profile data and linking to their profile page.",
  "frontend/src/hooks/useActor.ts": "Hook that manages the backend actor instance, creating it with the current identity and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and authentication lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for data fetching and mutations including user profiles, posts, conversations, likes, replies, and moderation actions.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, including activist-specific colors (blue, green, orange) and utility classes for styling text, backgrounds, borders, and scrollbars.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the main App component.",
  "frontend/src/pages/HomePage.tsx": "Landing page displaying a hero section with background image and call-to-action, plus a two-column layout showing latest discussion posts and platform rules sidebar.",
  "frontend/src/pages/MessagingPage.tsx": "Private messaging interface with conversation list sidebar and message thread view, including a modal to start new conversations; requires user authentication.",
  "frontend/src/pages/ModeratorDashboard.tsx": "Admin-only dashboard for managing user reports with tabs for pending, reviewed, and resolved reports; displays warning/strike/ban progression system information.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page displaying avatar, username, debate style, interests, social media links, follower counts, and user's posts; includes edit functionality for own profile.",
  "frontend/src/pages/RandomDebatePage.tsx": "Interface for users to opt into random debate matching by selecting their preferred debate style; currently a UI placeholder for backend matching logic.",
  "frontend/src/pages/SectionPage.tsx": "Dynamic section page component that displays posts filtered by section type (civil debate, aggressive debate, quotes/poems, random debates) with section-specific header, post creation form, and rules sidebar.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, container settings, border radius variables, custom shadows, Inter font family, and animation keyframes for accordions and other UI elements.",
  "project_state.json": "Project state document for Global Activist Debate platform describing architecture (user auth, debate categories, messaging, moderation), existing features (authentication, profiles, reactions, feeds, messaging), and known issues with avatar builder aesthetics."
}