{
  "backend/main.mo": "Main backend actor defining data types (UserProfile, Post, Reply, Conversation, Message, Report, ModerationAction) and state management with Map structures, including mixins for authorization and blob storage, and public functions for profile management, posts, and moderation.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: displaying CreatePostForm on HomePage for general feed posts (REQ-58) and adding visual feedback/success messaging to CreatePostForm (REQ-60).",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components and pages, including App.tsx with ProfileSetupModal, Layout with navigation, CreatePostForm with media upload and toast notifications, and various pages for sections, profiles, and messaging.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for background, foreground, primary, secondary, accent, destructive, borders, and sidebar elements using oklch color space.",
  "frontend/index.html": "HTML entry point with viewport meta tag, page title 'Global Activist Debate', root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Main app component with TanStack Router setup defining routes for home, sections, profile, messaging, random debate, and moderator pages, wrapped in ThemeProvider with ProfileSetupModal shown when authenticated user lacks profile.",
  "frontend/src/components/AvatarBuilder.tsx": "Empty file with no content.",
  "frontend/src/components/AvatarPreview.tsx": "Empty file with no content.",
  "frontend/src/components/ConversationList.tsx": "Displays list of conversations with participant names, last message preview, and selection highlighting, filtering out current user from participants and showing empty state when no conversations exist.",
  "frontend/src/components/CreatePostForm.tsx": "Form component for creating posts with content textarea, optional media upload with preview and removal, section-specific submission, toast notifications for success/error, automatic form clearing after success, and optional scroll-to-top behavior.",
  "frontend/src/components/DebateStyleBadge.tsx": "Badge component displaying debate style (Civil, Aggressive, Creative, Random) with color-coded styling using activist theme colors.",
  "frontend/src/components/DebateStyleSelector.tsx": "A component that displays a grid of selectable debate style cards (Civil and Aggressive) with icons, descriptions, and visual feedback for the selected style.",
  "frontend/src/components/FollowButton.tsx": "A button component that allows authenticated users to follow/unfollow other users, displaying appropriate icons and states based on the current follow relationship.",
  "frontend/src/components/HelpModal.tsx": "A modal dialog with tabbed content (Getting Started, Features, Community Rules) that provides comprehensive help documentation using accordions and scrollable areas.",
  "frontend/src/components/Layout.tsx": "The main application layout component with a sticky header, navigation (desktop and mobile), user avatar, and routing integration for the entire app.",
  "frontend/src/components/LikeButton.tsx": "A button component for liking/unliking posts with a heart icon, displaying like count and a hover card showing users who liked the post.",
  "frontend/src/components/LoginButton.tsx": "A button component that handles Internet Identity authentication, toggling between login and logout states with loading indicators.",
  "frontend/src/components/MessageThread.tsx": "Displays a conversation thread with participants, scrollable message history, and a form to send new messages within a conversation.",
  "frontend/src/components/ModerationActions.tsx": "Provides moderation action buttons (warning, strike, ban) for reports, displaying user moderation history and enforcing progressive discipline rules.",
  "frontend/src/components/PlatformRules.tsx": "A card component that displays the platform's four main rules (no personal attacks, opinions only, civil debates, aggressive debates) with icons and descriptions.",
  "frontend/src/components/PostCard.tsx": "Displays a single post with author info, timestamp, section badge, content, media, likes, and replies. Includes toggleable reply section and report button.",
  "frontend/src/components/PostFeed.tsx": "Renders a list of PostCard components, optionally sorting pinned posts first, with fallback message when no posts exist.",
  "frontend/src/components/ProfileEditModal.tsx": "Modal dialog for editing user profile including username, interests, debate style, and social media links. Saves changes via mutation hook.",
  "frontend/src/components/ProfileSetupModal.tsx": "Non-dismissible modal for first-time profile setup with username, interests, debate style, and optional social media fields.",
  "frontend/src/components/RandomDebateButton.tsx": "Button component that navigates to the random debate partner matching page with gradient styling.",
  "frontend/src/components/ReplySection.tsx": "Displays replies for a post with timestamps and authors, plus a form for authenticated users to add new replies.",
  "frontend/src/components/ReportButton.tsx": "Flag icon button that opens ReportModal for authenticated users to report content violations.",
  "frontend/src/components/ReportList.tsx": "Displays a list of reports with details (violation type, status, timestamp) and moderation actions for pending reports.",
  "frontend/src/components/ReportModal.tsx": "Modal form for submitting content reports with violation type selection and description textarea.",
  "frontend/src/components/SectionNavigation.tsx": "Horizontal navigation bar with icon buttons for switching between debate sections (civil, aggressive, quotes, random).",
  "frontend/src/components/StartConversationModal.tsx": "Modal dialog for starting a new conversation by entering a participant's principal ID and selecting conversation type (direct or group). Handles form submission and validation with toast notifications.",
  "frontend/src/components/UserAvatar.tsx": "Displays a circular avatar with the first letter of a username, using a consistent color generated from the username hash. Supports three size variants: small, medium, and large.",
  "frontend/src/components/UserLink.tsx": "Renders a clickable link to a user's profile page with optional avatar, fetching user profile data and displaying loading/error states. Shows 'Unknown User' if profile is not found.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state. Invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality. Manages authentication state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including user profiles, posts (create, like, reply), conversations, and moderation actions. Handles query caching and invalidation on mutations.",
  "frontend/src/index.css": "Global Tailwind CSS configuration with custom CSS variables for light/dark themes, including activist-themed color utilities (blue, green, orange) and scrollbar hiding utilities.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component into the DOM.",
  "frontend/src/pages/HomePage.tsx": "Main landing page with hero section, post feed displaying latest discussions, and sidebar with platform rules. Shows create post form for authenticated users and supports loading states.",
  "frontend/src/pages/MessagingPage.tsx": "Displays a two-column messaging interface with a conversation list on the left and message thread on the right, plus a modal to start new conversations. Requires authentication via Internet Identity.",
  "frontend/src/pages/ModeratorDashboard.tsx": "Admin-only dashboard for reviewing user reports organized into pending, reviewed, and resolved tabs. Displays warning system info (3 warnings → 1 strike → ban).",
  "frontend/src/pages/ProfilePage.tsx": "Displays user profile with avatar, debate style, interests, social media links, and user's posts. Shows edit button and profile edit modal for own profile.",
  "frontend/src/pages/RandomDebatePage.tsx": "UI for random debate matching where users select a debate style and opt-in to find a debate partner. Currently a placeholder with no backend matching logic implemented.",
  "frontend/src/pages/SectionPage.tsx": "Generic section page component that displays posts filtered by section type (civil debate, aggressive debate, quotes/poems, random debates) with a create post form and platform rules sidebar.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and parameter cleanup.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, container settings, custom activist brand colors, and animation keyframes for accordion components.",
  "project_state.json": "Project state file tracking a global activist debate platform with user authentication, profiles, debate forums (civil/aggressive), messaging, moderation, and avatar customization. Contains known issues including avatar builder bugs and missing post creation UI."
}