{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add post creation functionality to all sections",
  "requirements": [
    {
      "id": "REQ-58",
      "summary": "Display CreatePostForm on HomePage above the post feed for authenticated users to create general posts",
      "acceptanceCriteria": [
        "CreatePostForm appears on HomePage above the post feed",
        "Form is only visible to authenticated users",
        "Posts created from HomePage appear in the general feed",
        "Form follows the same styling and behavior as the section-specific CreatePostForm"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Add CreatePostForm component above the post feed section. Import and render CreatePostForm with appropriate props to create posts without a specific section. Ensure the form is only visible when the user is authenticated using the authorization component's useInternetIdentity hook. Position the form in the main content area above the existing post feed, maintaining the current two-column layout with rules sidebar. Pass appropriate section prop (or null/default) to CreatePostForm to indicate general feed posts."
        }
      ]
    },
    {
      "id": "REQ-59",
      "summary": "Verify CreatePostForm integration in all section pages for authenticated users to create section-specific posts",
      "acceptanceCriteria": [
        "CreatePostForm is visible on all four section pages (Civil Debate, Aggressive Debate, Quotes & Poems, Random Debates)",
        "Form is only visible to authenticated users",
        "Posts created from section pages are automatically tagged with the correct section type",
        "Form submission successfully creates posts that appear in the section-specific feed"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/SectionPage.tsx",
          "operation": "modify",
          "description": "Review and verify that CreatePostForm is properly integrated into the SectionPage component for all four sections (Civil Debate, Aggressive Debate, Quotes & Poems, Random Debates). Ensure the form is conditionally rendered only for authenticated users using the authorization component's useInternetIdentity hook. Verify that the section prop passed to CreatePostForm correctly maps to the section type from the route params so posts are automatically tagged with the correct section. Confirm the form appears above the post feed and follows consistent styling across all sections."
        }
      ]
    },
    {
      "id": "REQ-60",
      "summary": "Add visual feedback and success messaging to CreatePostForm with form clearing and optional scroll behavior",
      "acceptanceCriteria": [
        "Success toast notification appears when post is created successfully",
        "Form fields clear after successful submission",
        "User receives clear feedback if post creation fails",
        "Optional: Page scrolls to show the newly created post in the feed"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/CreatePostForm.tsx",
          "operation": "modify",
          "description": "Add success and error handling to the CreatePostForm component. Import and use the toast notification system (already wired via Toaster in App.tsx) to display success messages when posts are created successfully. Clear all form fields (content textarea and image upload) after successful submission. Display error toast notifications with appropriate messages when post creation fails. Optionally implement scroll behavior to show the newly created post in the feed after successful submission. Ensure the form properly handles loading states during submission and prevents multiple submissions."
        }
      ]
    }
  ]
}