{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Allow users to start conversations using username instead of Principal ID",
  "requirements": [
    {
      "id": "REQ-61",
      "summary": "Update StartConversationModal to use username input instead of Principal ID input for selecting conversation participants",
      "acceptanceCriteria": [
        "StartConversationModal displays a username input field instead of Principal ID field",
        "Users can type a username to search for other users",
        "The component validates that the entered username exists before allowing conversation creation",
        "Form submission creates a conversation using the username to resolve the Principal ID internally"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/StartConversationModal.tsx",
          "operation": "modify",
          "description": "Replace the Principal ID input field with a username input field. Update the form state to track username instead of principal string. Add validation to check if the username exists using the new lookup query hook before form submission. Display appropriate error messages when username is not found or invalid. Maintain the existing conversation type selection (direct/group) and overall modal structure."
        }
      ]
    },
    {
      "id": "REQ-63",
      "summary": "Add React Query hook for username-to-Principal ID lookup in useQueries.ts",
      "acceptanceCriteria": [
        "New React Query hook is available for username-to-Principal lookup",
        "Hook properly handles loading, error, and success states",
        "Query results are cached appropriately to avoid redundant backend calls"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new React Query hook named useFindUserIdByUsername that accepts a username string parameter and calls the backend findUserIdByUsername method. Configure the query with appropriate cache settings and enable it conditionally based on whether a valid username is provided. Return loading, error, and data states. Ensure the query integrates seamlessly with the existing query setup and uses the actor instance from useActor."
        }
      ]
    },
    {
      "id": "REQ-64",
      "summary": "Update StartConversationModal form submission to resolve username to Principal ID before creating conversation",
      "acceptanceCriteria": [
        "Form submission first resolves the username to Principal ID using the lookup query",
        "Resolved Principal ID is then used to create the conversation via existing backend function",
        "Appropriate error messages are displayed if username lookup fails",
        "Success flow remains unchanged after Principal ID is resolved"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/StartConversationModal.tsx",
          "operation": "modify",
          "description": "Integrate the useFindUserIdByUsername hook into the component. Update the form submission handler to first call the username lookup query to resolve the username to a Principal ID. Handle the case-insensitive lookup response. If the lookup succeeds, use the resolved Principal ID to call the existing startConversation mutation. If the lookup fails or returns null, display an error toast message indicating the username was not found. Maintain backward compatibility with the existing startConversation backend function signature by only changing the participant resolution logic."
        }
      ]
    }
  ]
}